# brew cask outdated --greedy
# brew cask upgrade --greedy

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap 'github/gh'
tap 'hashicorp/tap'

brew 'amfora'
brew 'bat'
brew 'catimg'
brew 'composer'
brew 'coreutils'
brew 'cowsay'
brew 'exa'
brew 'fd'
brew 'figlet'
brew 'fortune'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'glow'
brew 'gnupg'
brew 'go'
brew 'htop'
brew 'httpie'
brew 'httrack'
brew 'hugo'
brew 'jq'
brew 'lynx'
brew 'mas'
brew 'neovim'
brew 'pinentry-mac'
brew 'rclone'
brew 'rust'
brew 'shellcheck'
brew 'tealdeer'
brew 'the_silver_searcher'
brew 'tig'
brew 'trash'
brew 'tree'
brew 'vagrant'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

cask 'alfred'
cask 'backblaze'
cask "google-chrome"
cask 'bettertouchtool'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'imageoptim'
cask 'kaleidoscope'
cask 'kap'
cask 'moom'
cask 'netnewswire'
cask 'notion'
cask 'postman'
cask 'sequel-pro'
cask 'sidestep'
cask 'slack'
cask 'sourcetree'
cask 'sublime-text'
cask 'transmission'
cask 'transmit'
cask 'vlc'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'iterm2'
cask 'zoom'

cask "font-fira-code"
cask "font-fira-mono"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-open-sans"
cask "font-roboto"
cask "font-ubuntu-mono"
cask "font-ubuntu"

cask "font-ubuntu-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"

mas "1Password", id: 443987910
mas "Airmail", id: 918858936
mas "DaisyDisk", id: 411643860
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "Poolsuite FM", id: 1514817810
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
